batchsize_experiment/log/gpu_0.3_v2_ttft_2000_tpot_50/client_batchsize280_20251112_121020.log
/root/miniconda3/envs/openrlhf/lib/python3.10/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-12 12:10:25 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8011', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=280, model='/root/.cache/huggingface/hub/Qwen2.5-7B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=280, logprobs=None, request_rate=inf, burstiness=1.0, seed=42, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=['ttft:2000', 'tpot:50'], custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=0.8, top_k=20, min_p=None, temperature=0.7, repetition_penalty=1.05, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, load_input_requests=None, save_input_requests=True)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 280
100%|██████████| 280/280 [01:36<00:00,  2.89it/s]
============ Serving Benchmark Result ============
Successful requests:                     280       
Benchmark duration (s):                  96.84     
Total input tokens:                      143131    
Total generated tokens:                  286720    
Min_input_len:                           457.0     
Max_input_len:                           512.0     
Mean_input_len:                          511.1821428571429
P50_input_len:                           512.0     
P99_input_len:                           512.0     
Min_output_len:                          1024.0    
Max_output_len:                          1024.0    
Mean_output_len:                         1024.0    
P50_output_len:                          1024.0    
P99_output_len:                          1024.0    
Request throughput (req/s):              2.89      
Request goodput (req/s):                 0.17      
Output token goodput (tok/s):            169.19    
Total token goodput (tok/s):             253.55    
Output token throughput (tok/s):         2960.80   
Total Token throughput (tok/s):          4438.83   
---------------Time to First Token----------------
Mean TTFT (ms):                          22124.39  
Median TTFT (ms):                        4572.47   
P99 TTFT (ms):                           62265.71  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.99     
Median TPOT (ms):                        32.06     
P99 TPOT (ms):                           70.77     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.99     
Median ITL (ms):                         21.58     
P99 ITL (ms):                            128.62    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          60992.83  
Median E2EL (ms):                        59721.31  
P99 E2EL (ms):                           96352.01  
==================================================